# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [31]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [13]:
#Select from DataFrame using criteria from multiple columns
newdf=df[(df['col1']<2) & (df['col2']==444)]

In [14]:
newdf

   col1  col2 col3
0     1   444  abc

### Applying Functions

In [16]:
def times2(x):
    return x*2

In [19]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [20]:
def add100(x):
    return x+100

In [21]:
df['col2'].apply(add100)

0    544
1    655
2    766
3    544
Name: col2, dtype: int64

In [22]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [26]:
df['col2'].sum()

2109

Permanently Removing a Column

In [32]:
del df['col3']

In [33]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

Get column and index names:

In [35]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

Sorting and Ordering a DataFrame

In [37]:
df

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [42]:
df.sort_values('col2')  #inplace=False by default

   col1  col2
0     1   444
3     4   444
1     2   555
2     3   666

 Find Null Values or Check for Null Values

In [43]:
df.isnull()

    col1   col2
0  False  False
1  False  False
2  False  False
3  False  False

Drop rows with NaN Values

In [45]:
df.dropna()

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

Filling in NaN values with something else:

In [47]:
import numpy as np

In [48]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [49]:
df.fillna('New Fill')

       col1      col2 col3
0       1.0  New Fill  abc
1       2.0     555.0  def
2       3.0     666.0  ghi
3  New Fill     444.0  xyz

In [50]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [51]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [53]:
df.pivot_table(index=['A','B'],columns='C',values='D')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN